IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Agreements</name>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartnerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceType</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemSegment</name>
    <type>
      <types>CatalogRef.ItemSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>StartUsing</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndOfUse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ManagerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysBeforeDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.AgreementTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </attributes>
  <attributes>
    <name>ApArPostingDetail</name>
    <type>
      <types>EnumRef.ApArPostingDetail</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardAgreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>Kind</name>
    <type>
      <types>EnumRef.AgreementKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>UseCreditLimit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimitAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTerm</name>
    <type>
      <types>CatalogRef.PaymentSchedules</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeType</name>
    <type>
      <types>EnumRef.TradeAgentFeeTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeePercent</name>
    <type>
      <types>DefinedType.typePercent</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeItem</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeProfitLossCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeExpenseRevenueType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>RecordPurchasePrices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.PartnersBankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseOrdersForSettlements</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Intercompany</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IntercompanyBaseAgreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/AgreementKinds/AgreementKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementKinds</name>
 <enumValues>
  <name>Regular</name>
 </enumValues>
 <enumValues>
  <name>Standard</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ApArPostingDetail/ApArPostingDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ApArPostingDetail</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByAgreements</name>
 </enumValues>
 <enumValues>
  <name>ByStandardAgreement</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Stores/Stores.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Stores</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>UseGoodsReceipt</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UseShipmentConfirmation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Transit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NegativeStockControl</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>Location</name>
  <type>
   <types>CatalogRef.ObjectLocations</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Partners/Partners.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Partners</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>Customer</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Employee</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Consignor</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgent</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Other</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultCarrier</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Email</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Agreements/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;

	If ThisObject.Kind <> Enums.AgreementKinds.Regular Then
		ThisObject.PriceType = Catalogs.PriceTypes.EmptyRef();
		ThisObject.PriceIncludeTax = False;
		ThisObject.DaysBeforeDelivery = 0;
		ThisObject.Store = Catalogs.Stores.EmptyRef();
	EndIf;

	If ThisObject.ApArPostingDetail <> Enums.ApArPostingDetail.ByStandardAgreement Then
		ThisObject.StandardAgreement = Catalogs.Agreements.EmptyRef();
	EndIf;
	
	AdditionalProperties.Insert("IntercompanyBeforeWrite", Ref.Intercompany);
	AdditionalProperties.Insert("isNew", IsNew());
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If AdditionalProperties.Property("isNew") And AdditionalProperties.isNew 
		And ThisObject.Intercompany And ThisObject.IntercompanyBaseAgreement.IsEmpty() Then
		CatAgreementsServer.CreateMirorrAgreement(ThisObject);
	ElsIf AdditionalProperties.Property("isNew") And Not AdditionalProperties.isNew 
		And ThisObject.Intercompany And ThisObject.IntercompanyBaseAgreement.IsEmpty() Then
		CatAgreementsServer.UpdateMirorrAgreement(ThisObject);
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		FillPropertyValues(ThisObject, FillingData);
	EndIf;

	If ValueIsFilled(Partner) Then
		FillByPartner();
	EndIf;

	If Not ValueIsFilled(ApArPostingDetail) Then
		ApArPostingDetail = Enums.ApArPostingDetail.ByAgreements;
	EndIf;
	If Not ValueIsFilled(Kind) Then
		Kind = Enums.AgreementKinds.Regular;
	EndIf;
EndProcedure

Procedure FillByPartner()
	Query = New Query("SELECT TOP 1
					  |	Partners.Ref,
					  |	Partners.Customer,
					  |	Partners.Vendor
					  |FROM
					  |	Catalog.Partners AS Partners
					  |WHERE
					  |	Partners.Ref = &Ref");
	Query.SetParameter("Ref", Partner);

	PartnerInfo = Query.Execute().Select();
	If PartnerInfo.Next() Then
		If PartnerInfo.Vendor And Not PartnerInfo.Customer Then
			Type = Enums.AgreementTypes.Vendor;
		ElsIf Not PartnerInfo.Vendor And PartnerInfo.Customer Then
			Type = Enums.AgreementTypes.Customer;
		Else
			Type = Enums.AgreementTypes.EmptyRef();
		EndIf;
	EndIf;
	ThisObject.LegalName = DocumentsServer.GetLegalNameByPartner(ThisObject.Partner, ThisObject.LegalName);
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.ApArPostingDetail <> Enums.ApArPostingDetail.ByStandardAgreement Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "StandardAgreement");
	EndIf;

	If ThisObject.Kind <> Enums.AgreementKinds.Regular Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "PriceType");
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Type");
	EndIf;
	
	If ThisObject.Type = Enums.AgreementTypes.Other Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "PriceType");
	EndIf;
	
	If ThisObject.Intercompany Then
		
		If Not(ThisObject.Type = Enums.AgreementTypes.Customer 
			Or ThisObject.Type = Enums.AgreementTypes.Vendor) Then
				Cancel = True;
		EndIf;
		
		CheckedAttributes.Add("Partner");
		CheckedAttributes.Add("Company");
		CheckedAttributes.Add("LegalName");
	EndIf;
EndProcedure

Procedure OnCopy(CopiedObject)
	ThisObject.Number = "";
	ThisObject.Intercompany = False;
	ThisObject.IntercompanyBaseAgreement = Catalogs.Agreements.EmptyRef();
EndProcedure
